Бух_тест/src/Catalogs/НоменклатурныеГруппы/НоменклатурныеГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатурныеГруппы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НалоговоеНазначениеВПроизводстве</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Бух_тест/src/Catalogs/НалоговыеНазначенияАктивовИЗатрат/НалоговыеНазначенияАктивовИЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НалоговыеНазначенияАктивовИЗатрат</name>
  <comment>(Регл)</comment>
  <predefined>
    <items>
      <name>НКУ_БытУслуги</name>
      <description>Быт. усл. (пат.)</description>
    </items>
    <items>
      <name>БытУслуги</name>
      <description>Быт. усл. (пат.)</description>
    </items>
    <items>
      <name>БытУслугиАморт</name>
      <description>Быт. усл. (пат.), аморт.</description>
    </items>
    <items>
      <name>БытУслугиАмортНеОблагНДС</name>
      <description>Быт. усл. (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>БытУслугиНеОблагНДС</name>
      <description>Быт. усл. (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>НКУ_ИгорБизнес</name>
      <description>Игор. бизнес (пат.)</description>
    </items>
    <items>
      <name>ИгорБизнес</name>
      <description>Игор. бизнес (пат.)</description>
    </items>
    <items>
      <name>ИгорБизнесАморт</name>
      <description>Игор. бизнес (пат.), аморт.</description>
    </items>
    <items>
      <name>ИгорБизнесАмортНеОблагНДС</name>
      <description>Игор. бизнес (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ИгорБизнесНеОблагНДС</name>
      <description>Игор. бизнес (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>НДС_НеоблагаемаяХозДеятельность</name>
      <description>Необл. НДС, любая хоз.</description>
    </items>
    <items>
      <name>НДС_НеоблагаемаяНеХозДеятельность</name>
      <description>Необл. НДС, нехоз.</description>
    </items>
    <items>
      <name>НКУ_НеХозДеятельность</name>
      <description>Нехоз. д-сть</description>
    </items>
    <items>
      <name>НеХозДеятельность</name>
      <description>Нехоз. д-сть</description>
    </items>
    <items>
      <name>НеХозДеятельностьАморт</name>
      <description>Нехоз. д-сть, аморт.</description>
    </items>
    <items>
      <name>НеХозДеятельностьАмортНеОблагНДС</name>
      <description>Нехоз. д-сть, аморт., не обл. НДС</description>
    </items>
    <items>
      <name>НеХозДеятельностьНеОблагНДС</name>
      <description>Нехоз. д-сть, не обл. НДС</description>
    </items>
    <items>
      <name>НДС_Облагаемая</name>
      <description>Обл. НДС</description>
    </items>
    <items>
      <name>ОбмВалюты</name>
      <description>Обм. вал. (пат.)</description>
    </items>
    <items>
      <name>НКУ_ОбмВалюты</name>
      <description>Обм. вал. (пат.)</description>
    </items>
    <items>
      <name>ОбмВалютыАморт</name>
      <description>Обм. вал. (пат.), аморт.</description>
    </items>
    <items>
      <name>ОбмВалютыАмортНеОблагНДС</name>
      <description>Обм. вал. (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ОбмВалютыНеОблагНДС</name>
      <description>Обм. вал. (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>НКУ_Освобожденная</name>
      <description>Освобожд. ( п. 154.6 НКУ)</description>
    </items>
    <items>
      <name>НКУ_ПрограммнаяПродукция</name>
      <description>Прогр. прод. (субъекты индустрии)</description>
    </items>
    <items>
      <name>НДС_Пропорционально</name>
      <description>Пропорц. обл. НДС</description>
    </items>
    <items>
      <name>НКУ_Распределяемая</name>
      <description>Распределяемая</description>
    </items>
    <items>
      <name>НКУ_ТоргДеятельность</name>
      <description>Торг. д-сть (пат.)</description>
    </items>
    <items>
      <name>ТоргДеятельность</name>
      <description>Торг. д-сть (пат.)</description>
    </items>
    <items>
      <name>ТоргДеятельностьАморт</name>
      <description>Торг. д-сть (пат.), аморт.</description>
    </items>
    <items>
      <name>ТоргДеятельностьАмортНеОблагНДС</name>
      <description>Торг. д-сть (пат.), аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ТоргДеятельностьНеОблагНДС</name>
      <description>Торг. д-сть (пат.), не обл. НДС</description>
    </items>
    <items>
      <name>ХозДеятельность</name>
      <description>Хоз. д-сть</description>
    </items>
    <items>
      <name>НКУ_ХозДеятельность</name>
      <description>Хоз. д-сть</description>
    </items>
    <items>
      <name>ХозДеятельностьАморт</name>
      <description>Хоз. д-сть, аморт.</description>
    </items>
    <items>
      <name>ХозДеятельностьАмортНеОблагНДС</name>
      <description>Хоз. д-сть, аморт., не обл. НДС</description>
    </items>
    <items>
      <name>ХозДеятельностьНеОблагНДС</name>
      <description>Хоз. д-сть, не обл. НДС</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидНалоговойДеятельности</name>
    <type>
      <types>CatalogRef.ВидыНалоговойДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизируется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <type>
      <types>EnumRef.ВидыДеятельностиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаНалоговогоНазначения</name>
    <type>
      <types>EnumRef.ГруппыНалоговыхНазначений</types>
    </type>
  </attributes>
</mdclass:Catalog>

Бух_тест/src/Catalogs/НоменклатурныеГруппы/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ СВОЙСТВ

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));

КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Печать
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ДополнительныеОтчетыИОбработки
	
    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("НоменклатурнаяГруппа", Объект.Ссылка);
    
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Номенклатура.Код,
    |   Номенклатура.Ссылка КАК Номенклатура
    |ИЗ
    |   Справочник.Номенклатура КАК Номенклатура
    |ГДЕ
    |   Номенклатура.НоменклатурнаяГруппа.Ссылка = &НоменклатурнаяГруппа
    |
    |УПОРЯДОЧИТЬ ПО
    |   Номенклатура";
    
    ТаблицаТоваров = Запрос.Выполнить().Выгрузить();  
    
    СписокГруппы.Загрузить(ТаблицаТоваров);
    
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, Объект, "ГруппаДополнительныеРеквизиты");
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
    СписокНоменклатуры = ЭтаФорма.СписокГруппы.Выгрузить().ВыгрузитьКолонку("Номенклатура");
    
    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("ТекущаяНоменклатурнаяГруппа", Объект.Ссылка);
    Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
    
    Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
    |    ВЫБОР
    |        КОГДА (НЕ Номенклатура.НоменклатурнаяГруппа = &ТекущаяНоменклатурнаяГруппа)
    |            ТОГДА Номенклатура.Ссылка
    |        ИНАЧЕ 0
    |    КОНЕЦ КАК НоменклатураДобавить,
    |    ВЫБОР
    |        КОГДА Номенклатура.НоменклатурнаяГруппа = &ТекущаяНоменклатурнаяГруппа
    |            ТОГДА Номенклатура.Ссылка
    |        ИНАЧЕ 0
    |    КОНЕЦ КАК НоменклатураУдалить
    |ИЗ
    |    Справочник.Номенклатура КАК Номенклатура
    |ГДЕ
    |    (Номенклатура.Ссылка В (&СписокНоменклатуры)
    |                И (НЕ Номенклатура.НоменклатурнаяГруппа = &ТекущаяНоменклатурнаяГруппа)
    |            ИЛИ (НЕ Номенклатура.Ссылка В (&СписокНоменклатуры))
    |                И Номенклатура.НоменклатурнаяГруппа = &ТекущаяНоменклатурнаяГруппа)
    |    И (НЕ Номенклатура.ЭтоГруппа)";
    
    НачатьТранзакцию();
    Попытка
        
        ТаблицаТоваров = Запрос.Выполнить().Выбрать();  
        Пока ТаблицаТоваров.Следующий() > 0 Цикл
            Номенклатура = ТаблицаТоваров.НоменклатураДобавить;
            Если НЕ Номенклатура = 0 Тогда
                ТекущийТовар = Номенклатура.ПолучитьОбъект();
                ТекущийТовар.НоменклатурнаяГруппа = Объект.Ссылка;
                Текст =  НСтр("ru='Не удалось записать наименование %Товар%';uk='Не вдалося записати найменування %Товар%'");
                Текст = СтрЗаменить(Текст,"%Товар%", ТекущийТовар.Наименование);
                ТекущийТовар.Записать();
            КонецЕсли;
            
            Номенклатура = ТаблицаТоваров.НоменклатураУдалить;
            Если НЕ Номенклатура = 0 Тогда
                
                ТекущийТовар = Номенклатура.ПолучитьОбъект();
                ТекущийТовар.НоменклатурнаяГруппа = "";
                Текст =  НСтр("ru='Не удалось записать наименование %Товар%';uk='Не вдалося записати найменування %Товар%'");
                Текст = СтрЗаменить(Текст,"%Товар%", ТекущийТовар.Наименование);
                ТекущийТовар.Записать();
            КонецЕсли;
        КонецЦикла;
        
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
		ОписаниеОшибки = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки.Описание);
        ВызватьИсключение Текст;
        
    КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
    // Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура НалоговоеНазначениеВПроизводствеПриИзменении(Элемент)

	Если    Объект.НалоговоеНазначениеВПроизводстве = ПредопределенноеЗначение("Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_Пропорционально")
		ИЛИ Объект.НалоговоеНазначениеВПроизводстве = ПредопределенноеЗначение("Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность") Тогда
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Нельзя указывать в качестве налогового назначения в производстве ""%1""!';uk='Неможна вибирати в якості податкового призначення у виробництві  ""%1""!'"), Объект.НалоговоеНазначениеВПроизводстве);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.НалоговоеНазначениеВПроизводстве");
		
		Объект.НалоговоеНазначениеВПроизводстве = ПредопределенноеЗначение("Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка");
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ БСП

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтаФорма, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры
